; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob30) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate4)
	(at pallet2 distributor1)
	(clear crate3)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 436)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 302)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 31)
	(at crate1 depot0)
	(on crate1 crate0)
	(= (weight crate1) 20)
	(at crate2 depot0)
	(on crate2 crate1)
	(= (weight crate2) 67)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 86)
	(at crate4 distributor0)
	(on crate4 pallet1)
	(= (weight crate4) 17)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 crate0)
		(on crate2 pallet0)
		(on crate3 pallet2)
		(on crate4 pallet1)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 0 to 10
   goals met: 3 of 5
2. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate1)
   added: (lifting hoist0 crate2) (clear crate1)
   changed: (fuel-cost) from 10 to 11
   goals met: 3 of 5
3. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 67
   goals met: 3 of 5
4. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate0)
   added: (lifting hoist0 crate1) (clear crate0)
   changed: (fuel-cost) from 11 to 12
   goals met: 2 of 5
5. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 67 to 87
   goals met: 2 of 5
6. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 12 to 13
   goals met: 2 of 5
7. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   changed: (current_load truck1) from 87 to 118
   goals met: 2 of 5
8. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 118 to 51
   goals met: 2 of 5
9. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 3 of 5
10. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck1) from 51 to 20
   goals met: 3 of 5
11. (drop hoist0 crate0 crate2 depot0)
   deleted: (lifting hoist0 crate0) (clear crate2)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate2)
   goals met: 4 of 5
12. (unload hoist0 crate1 truck1 depot0)
   deleted: (in crate1 truck1) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck1) from 20 to 0
   goals met: 4 of 5
13. (drop hoist0 crate1 crate0 depot0)
   deleted: (lifting hoist0 crate1) (clear crate0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate0)
   goals met: 5 of 5
